
## :white_check_mark: Apply Succeeded (list-api-cdk-dev)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/7855)



<pre><code>Apply complete! Resources: 9 added, 0 changed, 12 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEnoncritical_FBD724EC: Refreshing state... [id=PILJECM]
pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEcritical_6A6D1B3B: Refreshing state... [id=P3BLF55]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394critical_75159CC4: Refreshing state... [id=P02AESF]
pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394noncritical_2861FC54: Refreshing state... [id=PFPYE0Z]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
aws_iam_role.listapi_codepipeline_codepipelinerole_EBEA3949: Refreshing state... [id=ListAPI-Dev-CodePipelineRole]
aws_iam_role_policy.listapi_codepipeline_codepipelinerolepolicy_415F7D5C: Refreshing state... [id=ListAPI-Dev-CodePipelineRole:ListAPI-Dev-CodePipeline-Role-Policy]
aws_s3_bucket.listapi_codepipeline_codepipelinebucket_47D128D9: Refreshing state... [id=pocket-codepipeline-cae3b0f8d579c48975de5bb6134c23ae]
data.terraform_remote_state.incident_management: Read complete after 0s
aws_codepipeline.listapi_codepipeline_codepipeline_D8E1DCC8: Refreshing state... [id=ListAPI-Dev-CodePipeline]
data.aws_sns_topic.backend_notifications: Reading...
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:410318598490:Backend-Dev-ChatBot]
aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF: Refreshing state... [id=ff652825-46f0-4fee-91e0-51570c6e5444:ListAPI-Dev-ECS]
data.aws_caller_identity.caller: Reading...
data.aws_caller_identity.caller: Read complete after 0s [id=410318598490]
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:ListAPI-Dev-Infrastructure-Alarm-Critical]
aws_cloudwatch_log_group.app-log-group: Refreshing state... [id=/Backend/ListAPI-Dev/ecs/app]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Reading...
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Refreshing state... [id=Z05686354P60ZQCIPLPY]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Read complete after 0s [id=/Shared/PublicSubnets]
aws_acm_certificate.application_alb_certificate_93966247: Refreshing state... [id=arn:aws:acm:us-east-1:410318598490:certificate/45a4a2f4-d483-463a-bc14-c657b5aab375]
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Refreshing state... [id=arn:aws:ecs:us-east-1:410318598490:cluster/ListAPI-Dev]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Reading...
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Reading...
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Read complete after 0s [id=410318598490]
aws_cloudwatch_log_group.application_ecs_service_ecs-aws-otel-collector_9F54C4B2: Refreshing state... [id=/ecs/ListAPI-Dev/aws-otel-collector20230724155214572600000002]
data.aws_region.pocket-vpc_current_region_1602AAD6: Reading...
data.aws_region.pocket-vpc_current_region_1602AAD6: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Reading...
data.aws_kms_alias.kms_alias: Reading...
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Read complete after 1s [id=/Shared/Vpc]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
data.aws_region.region: Reading...
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:ListAPI-Dev-Infrastructure-Alarm-Non-Critical]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Refreshing state... [id=listapi-dev-app]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=410318598490]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Read complete after 0s [id=4250039221]
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Reading...
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Read complete after 0s [id=410318598490]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Reading...
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Read complete after 0s [id=us-east-1]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Reading...
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 0s [id=/Shared/PublicSubnets]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=PUCU8ZL]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 0s [id=/Shared/Vpc]
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=PR367KY]
data.aws_vpc.pocket-vpc_2587E211: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Read complete after 0s [id=3888154257]
aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3: Refreshing state... [id=ListAPI-Dev-ECSCodeDeployRole]
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Refreshing state... [id=ListAPI-Dev-TaskRole]
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Refreshing state... [id=ListAPI-Dev-TaskExecutionRole]
aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:410318598490:notificationrule/58608ab6bb7ed6ce67480bdc9c77e27146c2f97d]
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 1s [id=PZQ6AUS]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 1s [id=PKAPG94]
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Refreshing state... [id=listapi-dev-app]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Refreshing state... [id=arn:aws:iam::410318598490:policy/ListAPI-Dev-TaskRolePolicy]
aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725: Refreshing state... [id=ListAPI-Dev-ECSCodeDeployRole-2023072415522252120000000b]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Refreshing state... [id=Z05686354P60ZQCIPLPY__b7eedcf7106f5af7875f292a1ac9e5b0.list-api.getpocket.dev._CNAME]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:ListAPI-Dev-Infrastructure-Alarm-Critical:ecefc1c0-fbc0-46a5-9a37-1be4d2ca045b]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:ListAPI-Dev-Infrastructure-Alarm-Non-Critical:5dbd9e47-61d2-4605-947b-c75f3b781813]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Refreshing state... [id=ListAPI-Dev-TaskExecutionRole-20230724160724961000000001]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Refreshing state... [id=ListAPI-Dev-TaskRole-20230724160725032700000002]
aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195: Refreshing state... [id=2023-07-24 15:53:32.58 +0000 UTC]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Read complete after 0s [id=ZCSIDA846KWLN]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Refreshing state... [id=ZCSIDA846KWLN_list-api.getpocket.dev_NS]
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 0s [id=vpc-012481e83ffa5e152]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:targetgroup/LSTAPI20230724155214576800000003/3b6dffc99093f973]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
aws_security_group.application_application_load_balancer_alb_security_group_7B45D070: Refreshing state... [id=sg-0d19ec74aca489071]
data.aws_vpc.pocket-vpc_2587E211: Read complete after 0s [id=vpc-012481e83ffa5e152]
aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:targetgroup/LSTAPI20230724155215151200000006/55563b3117b7e45a]
data.aws_vpc.dev-aurora_vpc_26B8D897: Reading...
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Reading...
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Reading...
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Read complete after 0s [id=us-east-1]
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Reading...
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Reading...
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 0s [id=us-east-1]
aws_db_subnet_group.dev-aurora_rds_subnet_group_A30BDDFD: Refreshing state... [id=listapi-dev20230724155216406800000007]
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 0s [id=us-east-1]
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Refreshing state... [id=sg-0447e30abe026a353]
aws_alb.application_application_load_balancer_alb_05EA9801: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:loadbalancer/app/LSTAPI2023072415522048030000000a/a0ba1fac32b567ba]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Read complete after 0s [id=us-east-1]
data.aws_vpc.dev-aurora_vpc_26B8D897: Read complete after 0s [id=vpc-012481e83ffa5e152]
aws_security_group.dev-aurora_rds_security_group_68028372: Refreshing state... [id=sg-0069cb6e256b55d21]
aws_alb_listener.application_listener_http_D74EC0ED: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/LSTAPI2023072415522048030000000a/a0ba1fac32b567ba/afbe0631d2c6cd53]
aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0: Refreshing state... [id=ListAPI-Dev-Alarm-HTTPTarget5xxErrorRate]
aws_route53_record.application_alb_record_8EA9D3F9: Refreshing state... [id=Z05686354P60ZQCIPLPY_list-api.getpocket.dev_A_1]
aws_alb_listener.application_listener_https_D31CB055: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/LSTAPI2023072415522048030000000a/a0ba1fac32b567ba/9bcce8d3d6c783c3]
aws_rds_cluster.dev-aurora_rds_cluster_DCA8A176: Refreshing state... [id=listapi-dev2023072415522256150000000c]
aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener-rule/app/LSTAPI2023072415522048030000000a/a0ba1fac32b567ba/9bcce8d3d6c783c3/0aa96ed5b9f1a288]
aws_secretsmanager_secret.dev-aurora_rds_secret_B28D161F: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:410318598490:secret:ListAPI-Dev/listapi-dev2023072415522256150000000c-bu0f2d]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
aws_secretsmanager_secret_version.dev-aurora_rds_secret_version_4B67F4C4: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:410318598490:secret:ListAPI-Dev/listapi-dev2023072415522256150000000c-bu0f2d|A64715C1-4E57-403F-ACF2-93CDC2276F3F]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Refreshing state... [id=ListAPI-Dev]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=3292408050]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Refreshing state... [id=arn:aws:iam::410318598490:policy/ListAPI-Dev-TaskExecutionRolePolicy]
null_resource.application_ecs_service_create-task-definition-file_6BADBAF7: Refreshing state... [id=8090295948112089310]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Refreshing state... [id=ListAPI-Dev-TaskExecutionRole-20230724160725091800000003]
local_file.application_ecs_service_appspec_94386B9C: Refreshing state... [id=0f4beca885b674cc3ca0517e3d2a5b831c3504ac]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Refreshing state... [id=arn:aws:ecs:us-east-1:410318598490:service/ListAPI-Dev/ListAPI-Dev]
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Refreshing state... [id=ListAPI-Dev]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Refreshing state... [id=service/ListAPI-Dev/ListAPI-Dev]
aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247: Refreshing state... [id=a157b8ea-f976-429d-8166-f8bcab025943]
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Refreshing state... [id=ListAPI-Dev-ScaleOutPolicy]
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Refreshing state... [id=ListAPI-Dev-ScaleInPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Refreshing state... [id=ListAPI-Dev Service Low CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Refreshing state... [id=ListAPI-Dev Service High CPU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_acm_certificate.listapi_application_albcertificate_2023E490 has moved to aws_acm_certificate.application_alb_certificate_93966247
    resource "aws_acm_certificate" "application_alb_certificate_93966247" {
        id                        = "arn:aws:acm:us-east-1:410318598490:certificate/45a4a2f4-d483-463a-bc14-c657b5aab375"
        tags                      = {
            "environment" = "Dev"
            "service"     = "ListAPI"
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_acm_certificate_validation.listapi_application_albcertificate_certificatevalidation_3F8E0455 has moved to aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195
    resource "aws_acm_certificate_validation" "application_alb_certificate_certificate_validation_25DAB195" {
        id                      = "2023-07-24 15:53:32.58 +0000 UTC"
        # (2 unchanged attributes hidden)
    }

  # aws_alb.listapi_application_applicationloadbalancer_alb_3DFD7FEC has moved to aws_alb.application_application_load_balancer_alb_05EA9801
    resource "aws_alb" "application_application_load_balancer_alb_05EA9801" {
        id                                          = "arn:aws:elasticloadbalancing:us-east-1:410318598490:loadbalancer/app/LSTAPI2023072415522048030000000a/a0ba1fac32b567ba"
        name                                        = "LSTAPI2023072415522048030000000a"
        tags                                        = {
            "environment" = "Dev"
            "service"     = "ListAPI"
        }
        # (23 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # aws_alb_listener.listapi_application_listenerhttp_9FB57557 has moved to aws_alb_listener.application_listener_http_D74EC0ED
    resource "aws_alb_listener" "application_listener_http_D74EC0ED" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/LSTAPI2023072415522048030000000a/a0ba1fac32b567ba/afbe0631d2c6cd53"
        tags              = {
            "environment" = "Dev"
            "service"     = "ListAPI"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_alb_listener.listapi_application_listenerhttps_68D78D4C has moved to aws_alb_listener.application_listener_https_D31CB055
    resource "aws_alb_listener" "application_listener_https_D31CB055" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/LSTAPI2023072415522048030000000a/a0ba1fac32b567ba/9bcce8d3d6c783c3"
        tags              = {
            "environment" = "Dev"
            "service"     = "ListAPI"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_alb_listener_rule.listapi_application_ecsservice_listenerrule_A08AAD77 has moved to aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F
    resource "aws_alb_listener_rule" "application_ecs_service_listener_rule_903F815F" {
        id           = "arn:aws:elasticloadbalancing:us-east-1:410318598490:listener-rule/app/LSTAPI2023072415522048030000000a/a0ba1fac32b567ba/9bcce8d3d6c783c3/0aa96ed5b9f1a288"
        tags         = {
            "environment" = "Dev"
            "service"     = "ListAPI"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_alb_target_group.listapi_application_ecsservice_bluetargetgroup_ecstargetgroup_D3F21073 has moved to aws_alb_target_group.applicatio

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

id             = "arn:aws:secretsmanager:us-east-1:410318598490:secret:ListAPI-Dev/listapi-dev2023072415522256150000000c-bu0f2d|A64715C1-4E57-403F-ACF2-93CDC2276F3F"
        # (5 unchanged attributes hidden)
    }

  # aws_security_group.listapi_application_applicationloadbalancer_albsecuritygroup_1977B65E has moved to aws_security_group.application_application_load_balancer_alb_security_group_7B45D070
    resource "aws_security_group" "application_application_load_balancer_alb_security_group_7B45D070" {
        id                     = "sg-0d19ec74aca489071"
        name                   = "ListAPI-Dev-HTTP/S Security Group20230724155214139400000001"
        tags                   = {
            "Name"        = "ListAPI-Dev-HTTP/S Security Group"
            "environment" = "Dev"
            "service"     = "ListAPI"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_security_group.listapi_application_ecsservice_ecssecuritygroup_F5081C30 has moved to aws_security_group.application_ecs_service_ecs_security_group_231C6B1E
    resource "aws_security_group" "application_ecs_service_ecs_security_group_231C6B1E" {
        id                     = "sg-0447e30abe026a353"
        name                   = "ListAPI-Dev-ECSSecurityGroup20230724155220337500000009"
        tags                   = {
            "environment" = "Dev"
            "service"     = "ListAPI"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_security_group.listapi_devaurora_rdssecuritygroup_AF85B96F has moved to aws_security_group.dev-aurora_rds_security_group_68028372
    resource "aws_security_group" "dev-aurora_rds_security_group_68028372" {
        id                     = "sg-0069cb6e256b55d21"
        name                   = "ListAPI-Dev20230724155218046100000008"
        tags                   = {
            "environment" = "Dev"
            "service"     = "ListAPI"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_sns_topic.listapi_pagerduty_alarmcriticaltopic_63004665 has moved to aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
    resource "aws_sns_topic" "pagerduty_alarm-critical-topic_F1534579" {
        id                                       = "arn:aws:sns:us-east-1:410318598490:ListAPI-Dev-Infrastructure-Alarm-Critical"
        name                                     = "ListAPI-Dev-Infrastructure-Alarm-Critical"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic.listapi_pagerduty_alarmnoncriticaltopic_113F0F31 has moved to aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
    resource "aws_sns_topic" "pagerduty_alarm-non-critical-topic_53C1A3B3" {
        id                                       = "arn:aws:sns:us-east-1:410318598490:ListAPI-Dev-Infrastructure-Alarm-Non-Critical"
        name                                     = "ListAPI-Dev-Infrastructure-Alarm-Non-Critical"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84 must be replaced
  # (moved from aws_sns_topic_subscription.listapi_pagerduty_alarmcriticalsubscription_049DA033)
-/+ resource "aws_sns_topic_subscription" "pagerduty_alarm-critical-subscription_E2168B84" {
      ~ arn                             = "arn:aws:sns:us-east-1:410318598490:ListAPI-Dev-Infrastructure-Alarm-Critical:ecefc1c0-fbc0-46a5-9a37-1be4d2ca045b" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      ~ endpoint                        = "https://events.pagerduty.com/integration/68ee0bb681884c08c0323ca17538d581/enqueue" # forces replacement -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:410318598490:ListAPI-Dev-Infrastructure-Alarm-Critical:ecefc1c0-fbc0-46a5-9a37-1be4d2ca045b" -> (known after apply)
      ~ owner_id                        = "410318598490" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B must be replaced
  # (moved from aws_sns_topic_subscription.listapi_pagerduty_alarmnoncriticalsubscription_CB7F35B6)
-/+ resource "aws_sns_topic_subscription" "pagerduty_alarm-non-critical-subscription_4702677B" {
      ~ arn                             = "arn:aws:sns:us-east-1:410318598490:ListAPI-Dev-Infrastructure-Alarm-Non-Critical:5dbd9e47-61d2-4605-947b-c75f3b781813" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      ~ endpoint                        = "https://events.pagerduty.com/integration/755135d647e74208d0d414f994dee8b5/enqueue" # forces replacement -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:410318598490:ListAPI-Dev-Infrastructure-Alarm-Non-Critical:5dbd9e47-61d2-4605-947b-c75f3b781813" -> (known after apply)
      ~ owner_id                        = "410318598490" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  # (moved from local_file.listapi_application_ecsservice_appspec_5A331B8C)
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

  # null_resource.application_ecs_service_create-task-definition-file_6BADBAF7 must be replaced
  # (moved from null_resource.listapi_application_ecsservice_createtaskdefinitionfile_E4E04DD8)
-/+ resource "null_resource" "application_ecs_service_create-task-definition-file_6BADBAF7" {
      ~ id       = "8090295948112089310" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "alwaysRun" = "2023-12-11T16:00:09Z" -> (known after apply)
        }
    }

  # pagerduty_service.listapi_pagerduty_pagerdutycritical_A80B75D9 has moved to pagerduty_service.pagerduty_pagerduty-critical_464EE7CD
    resource "pagerduty_service" "pagerduty_pagerduty-critical_464EE7CD" {
        id                      = "PUCU8ZL"
        name                    = "ListAPI-Dev-PagerDuty-Critical"
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # pagerduty_service.listapi_pagerduty_pagerdutynoncritical_8B103450 has moved to pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938
    resource "pagerduty_service" "pagerduty_pagerduty-non-critical_B4CB3938" {
        id                      = "PR367KY"
        name                    = "ListAPI-Dev-PagerDuty-Non-Critical"
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394critical_75159CC4 will be destroyed
  # (because pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394critical_75159CC4 is not in configuration)
  - resource "pagerduty_service_integration" "listapi_pagerduty_listapipagerdutycloudwatchF353A394critical_75159CC4" {
      - html_url        = "https://mozilla.pagerduty.com/services/PUCU8ZL/integrations/P02AESF" -> null
      - id              = "P02AESF" -> null
      - integration_key = "68ee0bb681884c08c0323ca17538d581" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PUCU8ZL" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394noncritical_2861FC54 will be destroyed
  # (because pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394noncritical_2861FC54 is not in configuration)
  - resource "pagerduty_service_integration" "listapi_pagerduty_listapipagerdutycloudwatchF353A394noncritical_2861FC54" {
      - html_url        = "https://mozilla.pagerduty.com/services/PR367KY/integrations/PFPYE0Z" -> null
      - id              = "PFPYE0Z" -> null
      - integration_key = "755135d647e74208d0d414f994dee8b5" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PR367KY" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEcritical_6A6D1B3B will be destroyed
  # (because pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEcritical_6A6D1B3B is not in configuration)
  - resource "pagerduty_service_integration" "listapi_pagerduty_listapipagerdutysentryC935FABEcritical_6A6D1B3B" {
      - html_url        = "https://mozilla.pagerduty.com/services/PUCU8ZL/integrations/P3BLF55" -> null
      - id              = "P3BLF55" -> null
      - integration_key = "cd5d8d990a7e4101d0f07180c084561b" -> null
      - name            = "Sentry" -> null
      - service         = "PUCU8ZL" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

  # pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEnoncritical_FBD724EC will be destroyed
  # (because pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEnoncritical_FBD724EC is not in configuration)
  - resource "pagerduty_service_integration" "listapi_pagerduty_listapipagerdutysentryC935FABEnoncritical_FBD724EC" {
      - html_url        = "https://mozilla.pagerduty.com/services/PR367KY/integrations/PILJECM" -> null
      - id              = "PILJECM" -> null
      - integration_key = "55f12a5c655f410fc0362fa33fe787af" -> null
      - name            = "Sentry" -> null
      - service         = "PR367KY" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = "PUCU8ZL"
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = "PR367KY"
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = "PUCU8ZL"
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = "PR367KY"
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

Plan: 9 to add, 0 to change, 12 to destroy.
null_resource.application_ecs_service_create-task-definition-file_6BADBAF7: Destroying... [id=8090295948112089310]
null_resource.application_ecs_service_create-task-definition-file_6BADBAF7: Destruction complete after 0s
pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEcritical_6A6D1B3B: Destroying... [id=P3BLF55]
pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEnoncritical_FBD724EC: Destroying... [id=PILJECM]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Creating...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Creating...
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Destroying... [id=arn:aws:sns:us-east-1:410318598490:ListAPI-Dev-Infrastructure-Alarm-Critical:ecefc1c0-fbc0-46a5-9a37-1be4d2ca045b]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destroying... [id=ListAPI-Dev]
aws_iam_role_policy.listapi_codepipeline_codepipelinerolepolicy_415F7D5C: Destroying... [id=ListAPI-Dev-CodePipelineRole:ListAPI-Dev-CodePipeline-Role-Policy]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Destroying... [id=arn:aws:sns:us-east-1:410318598490:ListAPI-Dev-Infrastructure-Alarm-Non-Critical:5dbd9e47-61d2-4605-947b-c75f3b781813]
aws_codepipeline.listapi_codepipeline_codepipeline_D8E1DCC8: Destroying... [id=ListAPI-Dev-CodePipeline]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destruction complete after 0s
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creating...
aws_iam_role_policy.listapi_codepipeline_codepipelinerolepolicy_415F7D5C: Destruction complete after 0s
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Destruction complete after 0s
pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394noncritical_2861FC54: Destroying... [id=PFPYE0Z]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Creating...
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Destruction complete after 0s
pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394critical_75159CC4: Destroying... [id=P02AESF]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Creating...
aws_codepipeline.listapi_codepipeline_codepipeline_D8E1DCC8: Destruction complete after 0s
aws_iam_role.listapi_codepipeline_codepipelinerole_EBEA3949: Destroying... [id=ListAPI-Dev-CodePipelineRole]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creation complete after 0s [id=ListAPI-Dev]
aws_s3_bucket.listapi_codepipeline_codepipelinebucket_47D128D9: Destroying... [id=pocket-codepipeline-cae3b0f8d579c48975de5bb6134c23ae]
aws_iam_role.listapi_codepipeline_codepipelinerole_EBEA3949: Destruction complete after 0s
null_resource.application_ecs_service_create-task-definition-file_6BADBAF7: Creating...
null_resource.application_ecs_service_create-task-definition-file_6BADBAF7: Provisioning with 'local-exec'...
null_resource.application_ecs_service_create-task-definition-file_6BADBAF7 (local-exec): Executing: ["/bin/sh" "-c" "aws --region us-east-1 ecs describe-task-definition --task-definition ListAPI-Dev --query 'taskDefinition' >> taskdef.json"]
aws_s3_bucket.listapi_codepipeline_codepipelinebucket_47D128D9: Destruction complete after 1s
local_file.application_ecs_service_appspec_94386B9C: Creating...
local_file.application_ecs_service_appspec_94386B9C: Creation complete after 0s [id=12d0ebc9ccf89b1698fe1d723e4245468ff33ffb]
pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEnoncritical_FBD724EC: Destruction complete after 1s
pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394noncritical_2861FC54: Destruction complete after 1s
pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEcritical_6A6D1B3B: Destruction complete after 1s
pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394critical_75159CC4: Destruction complete after 1s
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Creation complete after 1s [id=PIM4OEZ]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Creation complete after 1s [id=PY479AW]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Creation complete after 1s [id=PBDVNPJ]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Creating...
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Creation complete after 1s [id=PFPGO29]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Creating...
null_resource.application_ecs_service_create-task-definition-file_6BADBAF7: Creation complete after 1s [id=5646803574085872616]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Creation complete after 1s [id=arn:aws:sns:us-east-1:410318598490:ListAPI-Dev-Infrastructure-Alarm-Critical:1bc2d346-77bb-47a6-a28c-77848c2dff84]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Creation complete after 1s [id=arn:aws:sns:us-east-1:410318598490:ListAPI-Dev-Infrastructure-Alarm-Non-Critical:ea75c361-2e08-4401-b633-60fa418b64cd]
╷
│ Warning: Deprecated attribute
│ 
│   on cdk.tf.json line 2155, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│ 2155:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
│ 
│ The attribute "integration_key" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 7 more similar warnings elsewhere)
╵

Apply complete! Resources: 9 added, 0 changed, 12 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"d1d0f58e-3cd1-4a91-893c-01359f2a6efc","JobName":"list-api_infrastructure_apply_dev","PRNumber":40,"Program":"tfcmt","SHA1":"dfeffbd21766558083fdd0a29c57ff2d65d2f0ab","Target":"list-api-cdk-dev","Vars":{}} -->